Revit 2024 API
ElectricalSetting.CircuitNamePhaseB Property
 Circuit Naming by Phase - Phase B Label.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015 Subscription Update
Syntax
C#
public string CircuitNamePhaseB { get; set; }
Visual Basic
Public Property CircuitNamePhaseB As String
	Get
	Set
Visual C++
public:
property String^ CircuitNamePhaseB {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace